# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.
2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.
2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.
2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.
2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.
2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.
2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [41]:
import pandas as pd
import numpy as np


df = pd.DataFrame(
    np.random.randint(1, 100, size=(6, 4)),
    columns=['A', 'B', 'C', 'D']
)


df.set_index('A', inplace=True)

print(df)

     B   C   D
A
14  67  60   1
40  10  88  26
63  71  98  94
22  47  75  62
37  22  67  68
25  15  33  97

In [42]:
df=pd.DataFrame(np.random.randint(1,100,(3,3)),
                columns=['A','B','C'],index=['x','y','z'])

print(df)

value=df.loc['y','B']

print('Value=',value)

    A   B   C
x  68  73  93
y  51  59   7
z  19  63  65
Value= 59

In [43]:
df=pd.DataFrame(np.random.randint(1,100,(3,5))
                
                )

print(df)

    0   1   2   3   4
0  16  85  69  20   1
1  85  41  59  24   6
2  80   6  34  39  36

In [44]:
df['F']=df[0]*df[1]

print(df)

    0   1   2   3   4     F
0  16  85  69  20   1  1360
1  85  41  59  24   6  3485
2  80   6  34  39  36   480

In [45]:
df=pd.DataFrame(np.random.randint(1,100,(4,3)))

print(df)


col_sum=df.sum()
row_sum=df.sum(axis=1)

print(col_sum)
print(row_sum)

    0   1   2
0  27  14  61
1  28  95  20
2  82  66  80
3  79  20  33
0    216
1    195
2    194
dtype: int64
0    102
1    143
2    228
3    132
dtype: int64

In [46]:
df=pd.DataFrame(np.random.randint(1,100,(3,5)))

print(df)

df.loc[2,4]=np.nan
df.loc[0,2]=np.nan
df

    0   1   2   3   4
0  93  65  61  41  11
1  38  45  12  58   9
2  26   4   2  89  21

    0   1     2   3     4
0  93  65   NaN  41  11.0
1  38  45  12.0  58   9.0
2  26   4   2.0  89   NaN

In [47]:
df.fillna(df.mean(),inplace=True)
df

    0   1     2   3     4
0  93  65   7.0  41  11.0
1  38  45  12.0  58   9.0
2  26   4   2.0  89  10.0

In [48]:
df=pd.DataFrame(np.random.randint(1,100,(3,5)))


df.loc[2,4]=np.nan
df.loc[0,2]=np.nan

print(df)

df.dropna(inplace=True)

df

    0   1     2   3     4
0  47  37   NaN  27  86.0
1  55  35  19.0   7  39.0
2   8  92  69.0  23   NaN

    0   1     2  3     4
1  55  35  19.0  7  39.0

In [55]:
df=pd.DataFrame({'Category' : np.random.choice(['A','B','C'], size=10),
                'Value': np.random.randint(1,100,size=10)})
df

  Category  Value
0        B      9
1        C     51
2        C     63
3        A     62
4        A     10
5        A     44
6        C     71
7        B     81
8        A     91
9        C      1

In [56]:
df.groupby('Category')['Value'].agg(['sum','mean'])

          sum   mean
Category
A         207  51.75
B          90  45.00
C         186  46.50

In [60]:
df=pd.DataFrame({'Product':np.random.choice(['SHIRT','PANT'],size=10),
                'Category':np.random.choice(['A','B'],size=10),
                'Sale':np.random.randint(1,100,size=10)})
df

  Product Category  Sale
0    PANT        B    58
1   SHIRT        A    49
2   SHIRT        B    63
3   SHIRT        B    19
4   SHIRT        A    65
5   SHIRT        B    73
6    PANT        B    42
7    PANT        B    88
8   SHIRT        A    10
9    PANT        A     4

In [61]:
df.groupby('Category')['Sale'].agg(['sum'])

          sum
Category
A         128
B         343

In [62]:


# First DataFrame
df1 = pd.DataFrame({
    'Emp_ID': [101, 102, 103, 104],
    'Name': ['Amit', 'Neha', 'Ravi', 'Pooja']
})

# Second DataFrame
df2 = pd.DataFrame({
    'Emp_ID': [102, 103, 104, 105],
    'Department': ['HR', 'IT', 'Finance', 'Marketing']
})

# Merge DataFrames using common column
merged_df = pd.merge(df1, df2, on='Emp_ID')

print(merged_df)

   Emp_ID   Name Department
0     102   Neha         HR
1     103   Ravi         IT
2     104  Pooja    Finance

In [65]:
import pandas as pd

# First DataFrame
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

# Second DataFrame (different columns)
df2 = pd.DataFrame({
    'C': [7, 8, 9],
    'D': [10, 11, 12]
})

# 1️⃣ Concatenate along rows (axis=0)
row_concat = pd.concat([df1, df2], axis=0)
print("Row-wise concatenation:\n", row_concat)

# 2️⃣ Concatenate along columns (axis=1)
col_concat = pd.concat([df1, df2], axis=1)
print("\nColumn-wise concatenation:\n", col_concat)

Row-wise concatenation:
      A    B    C     D
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

Column-wise concatenation:
    A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [72]:
import pandas as pd
import numpy as np

# Create a date range (datetime index)
date_index = pd.date_range(start='2021-01-01',end='2021-12-31' , freq='D')

# Create DataFrame with random integers
df = pd.DataFrame({
    'Value': np.random.randint(10, 100, size=len(date_index))
}, index=date_index)

print("Original DataFrame:\n", df.head())

# Resample to monthly frequency and compute mean
monthly_mean = df.resample('W').mean()

print("\nMonthly Mean:\n", monthly_mean)

Original DataFrame:
             Value
2021-01-01     89
2021-01-02     30
2021-01-03     81
2021-01-04     76
2021-01-05     21

Monthly Mean:
                 Value
2021-01-03  66.666667
2021-01-10  66.571429
2021-01-17  43.142857
2021-01-24  52.714286
2021-01-31  37.714286
2021-02-07  55.000000
2021-02-14  57.857143
2021-02-21  50.857143
2021-02-28  63.714286
2021-03-07  56.571429
2021-03-14  55.714286
2021-03-21  51.571429
2021-03-28  55.142857
2021-04-04  51.428571
2021-04-11  70.571429
2021-04-18  59.857143
2021-04-25  46.571429
2021-05-02  57.428571
2021-05-09  70.000000
2021-05-16  47.571429
2021-05-23  61.285714
2021-05-30  44.714286
2021-06-06  52.857143
2021-06-13  40.142857
2021-06-20  58.714286
2021-06-27  51.000000
2021-07-04  49.857143
2021-07-11  54.285714
2021-07-18  54.428571
2021-07-25  32.428571
2021-08-01  56.857143
2021-08-08  54.571429
2021-08-15  44.857143
2021-08-22  64.285714
2021-08-29  31.571429
2021-09-05  60.000000
2021-09-12  63.857143
2021-09-19  49.857143
2021-09-26  54.142857
2021-10-03  49.428571
2021-10-10  51.285714
2021-10-17  63.142857
2021-10-24  56.285714
2021-10-31  53.000000
2021-11-07  48.285714
2021-11-14  50.000000
2021-11-21  51.142857
2021-11-28  47.857143
2021-12-05  60.000000
2021-12-12  50.142857
2021-12-19  59.428571
2021-12-26  54.857143
2022-01-02  59.000000

In [76]:
import pandas as pd
import numpy as np

# Create MultiIndex
index = pd.MultiIndex.from_tuples(
    [
        ('Electronics', 'Mobile'),
        ('Electronics', 'Laptop'),
        ('Furniture', 'Chair'),
        ('Furniture', 'Table')
    ],
    names=['Category', 'SubCategory']
)

# Create DataFrame
df = pd.DataFrame(
    {
        'Sales': np.random.randint(100, 500, 4),
        'Profit': np.random.randint(20, 100, 4)
    },
    index=index
)

print(df)

                         Sales  Profit
Category    SubCategory
Electronics Mobile         434      44
            Laptop         438      98
Furniture   Chair          129      90
            Table          339      22

In [79]:
df.groupby(level='Category').sum()

             Sales  Profit
Category
Electronics    872     142
Furniture      468     112

In [78]:
df.groupby(level='SubCategory').sum()

             Sales  Profit
SubCategory
Chair          129      90
Laptop         438      98
Mobile         434      44
Table          339      22